/*
 *
 * 给定一个字符串，请将字符串里的字符按照出现的频率降序排列。
 * 
 * 示例 1:
 * 
 * 
 * 输入:
 * &quot;tree&quot;
 * 
 * 输出:
 * &quot;eert&quot;
 * 
 * 解释:
 * &#39;e&#39;出现两次，&#39;r&#39;和&#39;t&#39;都只出现一次。
 * 因此&#39;e&#39;必须出现在&#39;r&#39;和&#39;t&#39;之前。此外，&quot;eetr&quot;也是一个有效的答案。
 * 
 * 
 * 示例 2:
 * 
 * 
 * 输入:
 * &quot;cccaaa&quot;
 * 
 * 输出:
 * &quot;cccaaa&quot;
 * 
 * 解释:
 * &#39;c&#39;和&#39;a&#39;都出现三次。此外，&quot;aaaccc&quot;也是有效的答案。
 * 注意&quot;cacaca&quot;是不正确的，因为相同的字母必须放在一起。
 * 
 * 
 * 示例 3:
 * 
 * 
 * 输入:
 * &quot;Aabb&quot;
 * 
 * 输出:
 * &quot;bbAa&quot;
 * 
 * 解释:
 * 此外，&quot;bbaA&quot;也是一个有效的答案，但&quot;Aabb&quot;是不正确的。
 * 注意&#39;A&#39;和&#39;a&#39;被认为是两种不同的字符。
 * 
 * 
 *
 */