/*
 *
 * 给定一个二维矩阵，计算其子矩形范围内元素的总和，该子矩阵的左上角为 (row1,&nbsp;col1) ，右下角为 (row2,&nbsp;col2)。
 * 
 * 
 * 上图子矩阵左上角&nbsp;(row1, col1) = (2, 1)&nbsp;，右下角(row2, col2) = (4, 3)，该子矩形内元素的总和为 8。
 * 
 * 示例:
 * 
 * 给定 matrix = [
 *   [3, 0, 1, 4, 2],
 *   [5, 6, 3, 2, 1],
 *   [1, 2, 0, 1, 5],
 *   [4, 1, 0, 1, 7],
 *   [1, 0, 3, 0, 5]
 * ]
 * 
 * sumRegion(2, 1, 4, 3) -&gt; 8
 * sumRegion(1, 1, 2, 2) -&gt; 11
 * sumRegion(1, 2, 2, 4) -&gt; 12
 * 
 * 
 * 说明:
 * 
 * 
 * 	你可以假设矩阵不可变。
 * 	会多次调用&nbsp;sumRegion方法。
 * 	你可以假设&nbsp;row1 &le; row2 且&nbsp;col1 &le; col2。
 * 
 * 
 *
 */