/*
 *
 * 给定一个以字符串表示的非负整数&nbsp;num，移除这个数中的 k 位数字，使得剩下的数字最小。
 * 
 * 注意:
 * 
 * 
 * 	num 的长度小于 10002 且&nbsp;&ge; k。
 * 	num 不会包含任何前导零。
 * 
 * 
 * 示例 1 :
 * 
 * 
 * 输入: num = &quot;1432219&quot;, k = 3
 * 输出: &quot;1219&quot;
 * 解释: 移除掉三个数字 4, 3, 和 2 形成一个新的最小的数字 1219。
 * 
 * 
 * 示例 2 :
 * 
 * 
 * 输入: num = &quot;10200&quot;, k = 1
 * 输出: &quot;200&quot;
 * 解释: 移掉首位的 1 剩下的数字为 200. 注意输出不能有任何前导零。
 * 
 * 
 * 示例 3 :
 * 
 * 
 * 输入: num = &quot;10&quot;, k = 2
 * 输出: &quot;0&quot;
 * 解释: 从原数字移除所有的数字，剩余为空就是0。
 * 
 * 
 *
 */